{
  "home": "خانه",
  "about": "درباره",
  "skills": "مهارت‌ها",
  "projects": "پروژه",
  "contact": "تماس",

  "Hi, I'm": " سلام،",
  "Alireza": "علیرضا",
  "Ghanbari": "قنبری هستم",
  "me1": "توسعه‌دهنده MERN Stack.",
  "me2": "من در ساخت برنامه‌های وب مدرن، مقیاس‌پذیر و با عملکرد بالا تخصص دارم با استفاده از",
  "me3": ". با علاقه به کدنویسی تمیز، تجربه کاربری شهودی و توسعه‌ی کامل، ایده‌های پیچیده را به راه‌حل‌های دیجیتال سریع و قابل اعتماد تبدیل می‌کنم.",
  "View My Work": "مشاهده کارهای من",
  "Scroll": "اسکرول کنید",

  "About": "درباره",
  "Me": "من",
  "Passionate Developer & Tech Creator": "توسعه‌دهنده پرشور و خالق فناوری",
  "about1": "من یک توسعه‌دهنده فول‌استک وب با تمرکز بر روی MERN Stack هستم. از تبدیل ایده‌های پیچیده به برنامه‌های وب تمیز، واکنش‌گرا و مقیاس‌پذیر لذت می‌برم. هدف من همیشه ایجاد راه‌حل‌هایی سریع، کاربردی و قابل نگهداری است.",
  "about2": "روی پروژه‌های متنوعی کار کرده‌ام؛ از صفحات فرود ساده گرفته تا داشبوردهای پویا و APIهای RESTful. به کد تمیز، ارتباط شفاف و یادگیری مداوم اهمیت می‌دهم تا همیشه آماده بمانم و بهترین نتایج ممکن را ارائه دهم.",
  "Get In Touch": "تماس با من",
  "See My CV": "مشاهده رزومه من",
  "Web Development": "توسعه وب",
  "Creating responsive websites and web applications with modern frameworks.": "ایجاد وب‌سایت‌ها و اپلیکیشن‌های واکنش‌گرا با استفاده از فریم‌ورک‌های مدرن.",
  "UI/UX Design": "طراحی UI/UX",
  "Designing intuitive user interface and seamless user experiences.": "طراحی رابط کاربری شهودی و تجربه کاربری روان.",
  "Project Management": "مدیریت پروژه",
  "leading projects from conception to completion with agile methodologies.": "هدایت پروژه‌ها از ایده‌پردازی تا اجرا با استفاده از متدولوژی‌های چابک.",

  "My": "من",
  "Skills": "مهارت‌های",
  "all": "همه",
  "frontend": "فرانت‌اند",
  "backend": "بک‌اند",
  "tools / Others": "ابزارها / سایر",

  "Featured": "منتخب",
  "Projects": "پروژه‌های",
  "A selection of my recent work built with clean code, modern tools, and real-world functionality.": "مجموعه‌ای از کارهای اخیر من که با کد تمیز، ابزارهای مدرن و عملکرد واقعی ساخته شده‌اند.",
  "Check My Github": "مشاهده گیت‌هاب من",
  "Razer Shop (MERN) - in progress...": "فروشگاه ریزر (MERN) - در حال توسعه...",
  "For more details, check out the project on GitHub. - Live demo is currently unavailable": "برای جزئیات بیشتر، پروژه را در گیت‌هاب بررسی کنید. - نسخه دمو فعلاً در دسترس نیست",
  "Real Estate App (MERN)": "اپلیکیشن املاک (MERN)",
  "Estate Farsi is a full-stack real estate app with property listings, auth, and Persian language support. Built with MongoDB, Express, React, and Node.js, it features a responsive, user-friendly UI.": "Estate Farsi یک اپلیکیشن فول‌استک املاک با قابلیت نمایش لیست ملک‌ها، احراز هویت و پشتیبانی از زبان فارسی است. با استفاده از MongoDB، Express، React و Node.js ساخته شده و دارای رابط کاربری واکنش‌گرا و کاربرپسند است.",
  "Blog App (MERN)": "اپلیکیشن وبلاگ (MERN)",
  "MERN Blog is a full-stack blogging platform with user authentication and CRUD post management. Built with MongoDB, Express, React, and Node.js, it features a clean, responsive UI.": "وبلاگ MERN یک پلتفرم فول‌استک برای انتشار مطالب است با احراز هویت کاربر و مدیریت پست‌ها. با MongoDB، Express، React و Node.js ساخته شده و دارای رابط کاربری تمیز و واکنش‌گرا است.",
  "Notes App (MERN)": "اپلیکیشن یادداشت‌ها (MERN)",
  "Notes App is a full-stack MERN application for creating, editing, and deleting notes with persistent storage. It includes user authentication, a clean responsive UI, and securely stores notes in MongoDB, using React frontend and Express/Node.js backend.": "اپلیکیشن یادداشت‌ها یک برنامه فول‌استک MERN برای ایجاد، ویرایش و حذف یادداشت‌ها با ذخیره‌سازی دائمی است. شامل احراز هویت کاربر، رابط کاربری تمیز و واکنش‌گرا بوده و یادداشت‌ها را به‌صورت ایمن در MongoDB ذخیره می‌کند. از React در فرانت‌اند و Express/Node.js در بک‌اند استفاده شده است.",
  "X Clone (MERN)": "کلون توییتر (MERN)",
  "A full-stack Twitter clone built with the MERN stack. It includes user authentication, tweet creation, likes, and follows, featuring a clean, responsive UI and real-time interactions.": "یک کلون توییتر فول‌استک ساخته‌شده با MERN. شامل احراز هویت، ایجاد توییت، لایک و دنبال کردن با رابط کاربری تمیز و واکنش‌گرا و تعاملات لحظه‌ای است.",
  "Apple Store": "فروشگاه اپل",
  "Apple Website is a responsive React app styled with Tailwind CSS, featuring product showcases and smooth navigation. It uses Three.js for 3D visuals and GSAP for animations, delivering an engaging and interactive user experience.": "وب‌سایت اپل یک برنامه واکنش‌گرای React است که با Tailwind CSS طراحی شده و دارای نمایش محصولات و ناوبری روان است. از Three.js برای نمایش سه‌بعدی و GSAP برای انیمیشن استفاده می‌کند تا تجربه کاربری جذاب و تعاملی فراهم کند.",
  "Cuctos Shop": "فروشگاه کاکتوس",
  "Cactus Shop is a responsive e-commerce landing page built with React and Tailwind CSS. It features plant products, promotions, and contact info in a clean, modern UI. The app uses React components and Tailwind’s utility-first styling for a smooth, interactive user experience.": "فروشگاه کاکتوس یک صفحه فرود فروشگاهی واکنش‌گراست که با React و Tailwind CSS ساخته شده. دارای محصولات گیاهی، تبلیغات و اطلاعات تماس با رابط کاربری تمیز و مدرن است. از کامپوننت‌های React و استایل‌های utility-first در Tailwind برای تجربه کاربری روان و تعاملی استفاده شده است.",
  "Fast Food Delivery App": "اپلیکیشن فست فود",
  "Burger Shop is a modern, responsive landing page for a fictional burger restaurant, built with HTML, Tailwind CSS, and JavaScript. It features a clean design with bold visuals, a call-to-action, featured menu items, and contact info, optimized for all devices.": "فروشگاه برگر یک صفحه فرود مدرن و واکنش‌گرا برای یک رستوران فرضی است که با HTML، Tailwind CSS و JavaScript ساخته شده. دارای طراحی تمیز با تصاویر برجسته، دعوت به اقدام، منوی پیشنهادی و اطلاعات تماس است و برای تمام دستگاه‌ها بهینه‌سازی شده است.",
  "Personal Portfolio": "نمونه‌کار شخصی",
  "This Simple Portfolio is a clean, responsive portfolio website built using React and Tailwind CSS. It serves as a personal branding site, showcasing a developer's skills, projects, and contact information in a modern and visually appealing layout.": "این نمونه‌کار ساده یک وب‌سایت واکنش‌گرا و تمیز است که با React و Tailwind CSS ساخته شده. به‌عنوان یک وب‌سایت شخصی برای برندینگ توسعه‌دهنده استفاده می‌شود و مهارت‌ها، پروژه‌ها و اطلاعات تماس را در یک چیدمان مدرن و جذاب به نمایش می‌گذارد.",
  "Recipe App": "اپلیکیشن دستور پخت",
  "A dynamic web application built with React. It fetches real-time recipe data from an external API and displays it in a clean, responsive interface. Users can search for recipes and view details like ingredients, preparation steps, and images. The app features a component-based architecture and works seamlessly across devices.": "یک اپلیکیشن وب پویا ساخته‌شده با React. اطلاعات دستور پخت را به‌صورت لحظه‌ای از یک API خارجی دریافت کرده و در رابطی تمیز و واکنش‌گرا نمایش می‌دهد. کاربران می‌توانند دستور غذاها را جستجو کرده و جزئیاتی مانند مواد لازم، مراحل تهیه و تصاویر را مشاهده کنند. این برنامه دارای معماری مبتنی بر کامپوننت بوده و روی همه دستگاه‌ها به‌خوبی کار می‌کند.",
  "Buger King": "برگر کینگ",
  "This project is a responsive, multi-section website built using HTML, CSS, and Bootstrap 5. It demonstrates fundamental web development skills and showcases how to effectively use Bootstrap's grid system, components, and utilities to create a polished, mobile-friendly layout.": "این پروژه یک وب‌سایت واکنش‌گرا و چندبخشی است که با HTML، CSS و Bootstrap 5 ساخته شده. مهارت‌های پایه توسعه وب را نشان داده و نحوه استفاده مؤثر از سیستم گرید، کامپوننت‌ها و ابزارهای Bootstrap برای ساخت یک چیدمان شیک و سازگار با موبایل را نمایش می‌دهد.",
  "Virtualr Landing": "صفحه فرود Virtualr",
  "Virtualr Landing Page is a modern and responsive single-page application built using React and Tailwind CSS. It serves as the front-facing website for a virtual reality (VR) focused product or service, showcasing features, testimonials, and call-to-action elements designed to attract users and convey the brand's innovative edge.": "صفحه فرود Virtualr یک اپلیکیشن تک‌صفحه‌ای مدرن و واکنش‌گراست که با React و Tailwind CSS ساخته شده. به‌عنوان وب‌سایت مقدماتی برای یک محصول یا خدمات واقعیت مجازی (VR) استفاده می‌شود و شامل ویژگی‌ها، نظرات کاربران و عناصر دعوت به اقدام است که برای جذب مخاطب و نمایش نوآوری برند طراحی شده‌اند.",

  "Get In": "ارتباط",
  "Touch": "با من",
  "Have a project in mind or want to collaborate? Feel free to reach out. I'm always open to discussing new opportunities.": "پروژه‌ای در ذهن دارید یا می‌خواهید همکاری کنید؟ با خیال راحت تماس بگیرید. من همیشه آماده گفتگو درباره فرصت‌های جدید هستم.",
  "Contact information": "اطلاعات تماس",
  "Email": "ایمیل",
  "Phone": "تلفن",
  "Location": "موقعیت مکانی",
  "Iran, Mashhad": "ایران، مشهد",
  "Connect With Me": "با من در ارتباط باشید",
  "Send a Message": "ارسال پیام",
  "Your Name": "نام شما",
  "Your Email": "ایمیل شما",
  "Your Message": "پیام شما",
  "Send Message": "ارسال پیام",
  "Hello, I'd like to talk about...": "سلام، می‌خواهم دربارهٔ ... صحبت کنم"
}
